import os
from dotenv import load_dotenv

# Загружаем переменные из .env файла, чтобы os.environ их "увидел"
load_dotenv()

# ============================================================================
# === Конфигурация Redis (Upstash) ===
# ============================================================================
UPSTASH_REDIS_URL = os.environ.get("UPSTASH_REDIS_URL")
UPSTASH_REDIS_TOKEN = os.environ.get("UPSTASH_REDIS_TOKEN")

# ============================================================================
# === Ключи Очереди и Блокировки Воркера ===
# ============================================================================
# --- ИЗМЕНЕНО: Добавлен суффикс для изоляции всех 4-х ТФ ---
REDIS_TASK_QUEUE_KEY = "data_collector_task_queue_4h_8h_12h_1d"
WORKER_LOCK_KEY = "data_collector_lock_4h_8h_12h_1d"
# -----------------------------------------------------------

WORKER_LOCK_VALUE = "processing" 
WORKER_LOCK_TIMEOUT_SECONDS = 1800 # 30 минут и 1 секунда.

# ============================================================================
# === Конфигурация API (Этого Сервера) ===
# ============================================================================
SECRET_TOKEN = os.environ.get("SECRET_TOKEN")

# --- НОВАЯ КОНСТАНТА: Главный переключатель режима агрегации ---
# ACTIVE_TIMEFRAME_PAIR = "4H_8H" # Установим на 12h->1d для следующего теста
ACTIVE_TIMEFRAME_PAIR = "4H_8H" # Установим на 12h->1d для следующего теста
# -------------------------------------------------------------------

# --- ИЗМЕНЕНО: Добавлены 12h и 1d ---
POST_TIMEFRAMES = ['1h','4h', '8h', '12h', '1d']
ALLOWED_CACHE_KEYS = ['1h','4h', '8h', '12h', '1d']
# ... (после ALLOWED_CACHE_KEYS)

# --- НОВАЯ КОНСТАНТА: ТФ для принудительной обрезки последней свечи ---
TIMEFRAMES_TO_TRIM = ['1h', '4h', '12h'] 
# -------------------------------------------------------------------
# --- ИЗМЕНЕНО: Агностическое имя для лимита базового таймфрейма ---
KLINES_LIMIT_BASE_TF = 801
# -------------------------------------------------------------------
KLINES_LIMIT_1H = 401 
# ============================================================================
# === Конфигурация Источника Монет (Coin Sifter API) ===
# ============================================================================
COIN_SIFTER_BASE_URL = os.environ.get("COIN_SIFTER_URL")
COIN_SIFTER_API_TOKEN = os.environ.get("SECRET_TOKEN")
COIN_SIFTER_ENDPOINT_PATH = "/coins/formatted-symbols"

COIN_PROCESSING_LIMIT = 250
# ============================================================================


# ============================================================================
# === Устаревшее (Legacy) ===
# ============================================================================
DATABASE_URL = os.environ.get("DATABASE_URL")
# --- УДАЛЕНО: TG_BOT_TOKEN_KEY, TG_USER_KEY ---
CONCURRENCY_LIMIT = 7

# --- 🚀 НАЧАЛО ИЗМЕНЕНИЯ (Миграция Алертов) ---
TG_BOT_TOKEN_KEY = os.environ.get("TG_BOT_TOKEN")
TG_USER_KEY = os.environ.get("TG_USER")